---
kind: method
id: M:Autodesk.Revit.DB.Document.GetCloudModelPath
zh: 文档、文件
source: html/087a7c14-1a6e-7022-c47b-923e90f4c5be.htm
---
# Autodesk.Revit.DB.Document.GetCloudModelPath Method

**中文**: 文档、文件

Gets the cloud model path of the cloud model.

## Syntax (C#)
```csharp
public ModelPath GetCloudModelPath()
```

## Returns
The cloud model path

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This Document is a not cloud model, cannot execute this operation.